Revit 2027 API
WallSide Enumeration
 Represents the possible sides of a wall where a sweep or reveal may be attached.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum WallSide
Public Enumeration WallSide
public enum class WallSide
type WallSide
Members
Member name | Value | Description
Exterior | 0 |  The exterior of the wall.
Interior | 1 |  The interior of the wall.
See Also
Reference
Autodesk.Revit.DB Namespace